Repository: tz-world/weex
Catalog: i18n/doc/po/*/advanced/how-*-works.po
Languages: it

source: How it works
it: 它是如何工作的 ???

source: Overview
it: 概述 ???

source: Weex is a extendable cross-platform solution for dynamic programming and publishing projects. In the source code you can write pages or components with `<template>`, `<style>` and `<script>` tags, and then transform them into bundles for deploying. In server-side we can use these JS bundles for client request. When client get a bundle from server, it will be processed by client-side JavaScript engine and manages the native view rendering, the native API invoking and user interactions.
it: weex是动态规划和出版项目可扩展的跨平台解决方案。在源代码中你可以写页或组件与`<template>``, ``<style>`` and ``<script>`标签，然后变换成束的部署。在服务器端，我们可以使用这些JS捆绑客户请求。当客户端从服务器得到一束，它将通过客户端JavaScript引擎处理和管理本地视图渲染，本地API调用和用户交互。 ???

source: Whole Workflow
it: 整个流程 ???

source: According to the workflow above, you need:
it: 根据上面的工作流程，你需要： ???

source: Transformer: A nodejs tool to transform the source code into the bundle code.
it: 变压器：一Nodejs工具变换源代码到束编码。 ???

source: JS Framework: A JavaScript framework runing in the client which manage Weex instance. The instance which created from a JS bundle builds virtual DOM tree. Also it sends/receives native calls for native view rendering, native APIs and user interactions.
it: js框架：一个JavaScript框架运行，管理weex实例的客户端。它创建一个JS束建立虚拟的DOM树的实例。它还发送/接收本地调用本地视图渲染，本地的接口和用户交互。 ???

source: Native Engine: There are many different ports for different platforms: iOS/Android/HTML5. They have the same components design, module APIs design and rendering effect. So they can work with the one and the same JS Framework and JS bundles.
it: 原生引擎：有许多不同的港口不同的平台：iOS / Android和HTML5。他们有相同的组件设计，模块的设计和渲染效果。所以他们能与同一个js框架和JS束。 ???

source: Transformer
it: 变压器 ???

source: The transformer transforms a source code into a bundle code. The whole work could be divided into three parts:
it: 变压器将一个源代码转换成一个包码。整个工作可分为三个部分： ???

source: Transform `<template>` into a JSON-like tree and transform data-binding attribute into a function prop which return the correct data value. For example: `<foo a="{% raw %}{{x}}{% endraw %}" b="1" />` will be transformed into `{type: "foo", attr: {a: function () {return this.x}, b: 1}}`.
it: 变换`<template>`` into a JSON-like tree and transform data-binding attribute into a function prop which return the correct data value. For example: ``<foo a="{% raw %}{{x}}{% endraw %}" b="1" />`` will be transformed into ``{type: "foo", attr: {a: function () {return this.x}, b: 1}}`。 ???

source: Transform `<style>` into a JSON tree. For example: `.classname {name: value;}` will be transformed into `{classname: {name: value}}`.
it: 变换`<style>`` into a JSON tree. For example: ``.classname {name: value;}`` will be transformed into ``{classname: {name: value}}`。 ???

source: Join the two above with `<script>` content. The three parts will be joined together and wrapped into a JavaScript AMD module.
it: 加入两个以上`<script>`内容。三部分将结合在一起，包裹成一个JavaScript AMD模块。 ???

source: A whole example (`main.we`):
it: 一个完整的案例( z598131628476z )： ???

source: will transformed into:
it: 将转化为： ???

source: Additionally, the transformer could also do more things: combo the bundles, bootstrap with config and external data. For more information, please see the syntax specs.
it: 此外，变压器也可以做更多的事情：组合的捆绑，引导与配置和外部数据。对于更多的信息，请参阅语法规格。 ???

source: JS Framework
it: js框架 ???

source: JS Framework will run in native JavaScript engine at the beginning preparation phase. It has `define()` and `bootstrap()` functions for each the bunlde code. Once a JS bundle requested from server, the code will be executed. `define()` will register all modules first, then `bootstrap()` will start compiling main component into virtual DOM and send rendering calls to native.
it: js框架将运行在本地JavaScript引擎在开始准备阶段。它有`define()`` and ``bootstrap()`` functions for each the bunlde code. Once a JS bundle requested from server, the code will be executed. ``define()`` will register all modules first, then ``bootstrap()`将开始编制主要成分为虚拟DOM和发送绘制调用本地。 ???

source: There are two key methods for the bridge between JS and native:
it: 有JS和本土之间的桥梁两个关键方法： ???

source: `callNative` sends commands from JavaScript to native. So it's called from JavaScript and implemented with native code. All commands are native APIs organized by modules, for example `rendering`, `networking`, `authorizing`, and other client-side features like `toast` etc.
it: `callNative`` sends commands from JavaScript to native. So it's called from JavaScript and implemented with native code. All commands are native APIs organized by modules, for example ``rendering``, ``networking``, ``authorizing``, and other client-side features like ``toast`等 ???

source: `callJS` sends commands from native to JavaScript. So it's called from native and implemented by JS Framework. All commands are user interactions or native callbacks.
it: `callJS`发送命令从本地JavaScript。所以它被称为从本地和JS框架实现。所有的命令都是用户交互或本机回调。 ???

source: Native RenderEngine
it: 本地renderengine ???

source: Native RenderEngine will supplies many native components and modules for call.
it: 本地renderengine将呼叫提供许多本地组件和模块。 ???

source: **Component** is an element in the screen which have a certain view and behavior. It could be configured with some attributes and style properties, and could response user interactions. There are some common components like `<div>`, `<text>`, `<image>` etc.
it: * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *。它可以配置一些属性和样式属性，并可以响应用户交互。有一些常见的成分如`<div>``, ``<text>``, ``<image>`等 ???

source: **Module** is a set of APIs which could be called from JS Framework. Some of them also have to make async callbacks to JS Framework, for example: send HTTP request.
it: *模块*是一套API可以调用js框架。他们中的一些人也可以异步回调JS框架，例如：发送HTTP请求。 ???

source: During a Weex instance works, Native RenderEngine receives all kinds of module API calls from JS Framework. These calls will create or update components for view and use client-side features like `toast`. When a user interaction or module API callback happens, It will call `callJS()` from JS Framework. These jobs could walk through the Weex instance lifecycle till the instance is destroyed. As is shown in the architecture figure, H5 RenderEngine is a special RenderEngine with almost the same functions as native RenderEngines.
it: 一个weex实例在工作过程中，本土renderengine接收各种模块API调用的js框架。这些调用会创建或更新视图和使用客户端功能`toast``. When a user interaction or module API callback happens, It will call ``callJS()`从JS框架组件。这些工作可以通过步行weex实例生命周期直到实例被销毁。正如在建筑图所示，是一个特殊的renderengine H5 renderengine几乎相同的功能作为本土renderengines。 ???

source: ![arch](http://gtms02.alicdn.com/tps/i2/TB1ootBMpXXXXXrXXXXwi60UVXX-596-397.png)
it: ![弓】(http://gtms02.alicdn.com/tps/i2/TB1ootBMpXXXXXrXXXXwi60UVXX-596-397.png)???

source: Weex Architecture
it: weex架构 ???

source: call native from javascript
it: 从JavaScript调用本地 ???

source: call javascript from native
it: 从本地调用JavaScript ???

source: Render Flow
it: 渲染流程 ???

source: ![render flow](http://gtms03.alicdn.com/tps/i3/TB1_SA4MXXXXXXGaXXXpZ8UVXXX-519-337.png)
it: ![流](http://gtms03.alicdn.com/tps/i3/TB1_SA4MXXXXXXGaXXXpZ8UVXXX-519-337.png)渲染 ???

source: Weex Render Flow
it: weex渲染流程 ???

source: Input is virtual dom.
it: 输入虚拟DOM。 ???

source: **Build Tree**. Parse JSON data (virtual dom) to a Render Tree (RT).
it: * *建立树。解析JSON数据(virtual dom)来渲染树(RT)。 ???

source: **Apply Style**. Attach css style to RT nodes.
it: ***应用样式**。附加CSS样式RT节点。 ???

source: **Create View**. Create native views for each RT node.
it: **创建视图**。为每个节点创建本地视图。 ???

source: **Attach Event**. Attach events for each view.
it: **附加事件**。为每个视图附加事件。 ???

source: **CSS Layout**. Use [css-layout](https://github.com/facebook/css-layout) to calculate the layout of each view.
it: * * * * CSS布局。使用CSS布局] [(https://github.com/facebook/css-layout)计算每个视图的布局。 ???

source: **Update Frame**. Update layout parameters of each view.
it: **更新框架。更新每个视图的布局参数。 ???

source: Output is Native or H5 Views.
it: 输出是本土的还是H5的看法。 ???

source: In H5 Render Flow, `CSS Layout` and `Update Frame` are implemented by browser engine like webkit.
it: 在H5渲染流程，`CSS Layout`` and ``Update Frame`浏览器引擎WebKit实现这样的。 ???
